Revit 2024 API
AnalysisDisplayStyle.SetMarkersAndTextSettings Method
 Set markers and text settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void SetMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings markersAndTextSettings
)
Visual Basic
Public Sub SetMarkersAndTextSettings ( _
	markersAndTextSettings As AnalysisDisplayMarkersAndTextSettings _
)
Visual C++
public:
void SetMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings^ markersAndTextSettings
)
Parameters
markersAndTextSettings
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  markers and text settings were not created with the object.
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace